
&НаСервере
Функция ПечатьНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	МассивПечати = новый Массив;
	МассивПечати.Добавить(ДокументОбъект.ссылканаОбъект);
	Объект.ИспользоватьАртикуль = Элементы.использоватьАртикуль;
	Результат = ДокументОбъект.Печать(МассивПечати, Новый ТаблицаЗначений, Новый СписокЗначений, Новый Структура);	 
	возврат Результат;
КонецФункции
 
&НаКлиенте
Процедура Печать(Команда)
	результат = ПечатьНаСервере();
	Результат.Показать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СсылкаНаОбъект = Параметры.ОбъектыНазначения[0];
КонецПроцедуры

