&наКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения) Экспорт
	Объект.СсылкаНаОбъект = ОбъектыНазначения[0];
	ДанныеДиалога = данныеДляДиалога();
	Если НЕ ЗначениеЗаполнено(ДанныеДиалога.Организация) Тогда
		ВызватьИсключение НСтр("ru = 'Заполнение возможно только при выбранной организации.'");
		Возврат;
	КонецЕсли;

	Если  ДанныеДиалога.ЧислоСтрок > 0  Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение,"Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,0)
	Иначе
		Инициализировать();
	КонецЕсли;
    ВладелецФормы.Прочитать();
КонецПроцедуры




&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		Инициализировать();
	КонецЕсли;
КонецПроцедуры



&НаСервере
Функция данныеДляДиалога()
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СсылкаНаОбъект,"Организация,ОС",Истина,);
	ДанныеДляВозврата = Новый Структура;
	ДанныеДляВозврата.Вставить("Организация", данные.Организация);
	ДанныеДляВозврата.Вставить("ЧислоСтрок", данные.Ос.Выгрузить().Количество());	
	Возврат ДанныеДляВозврата;
КонецФункции




&наСервере
Процедура Инициализировать() 

 	целевойобъект = Объект.СсылкаНаОбъект.ПолучитьОбъект();	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИГС_ОстаткиОсновныхСредствОстатки.ОС КАК ОсновноеСредство,
	|	ИГС_ОстаткиОсновныхСредствОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ВТСписокОС
	|ИЗ
	|	РегистрНакопления.игсОстаткиОСНаСкладах.Остатки(
	|			&ДатаОстатков,
	|			Организация = &Организация
	|				И Склад = &Склад) КАК ИГС_ОстаткиОсновныхСредствОстатки
	|ГДЕ
	|	ИГС_ОстаткиОсновныхСредствОстатки.КоличествоОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ХозрасчетныйОстатки_ВосстановительнаяСтоимость.СуммаОстатокДт, 0) КАК СтоимостьПоДаннымУчета,
	|	ИСТИНА КАК НаличиеПоДаннымУчета
	|ИЗ
	|	ВТСписокОС КАК ВТСписокОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ДатаОстатков, Организация = &Организация) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОстатков, , &СубконтоОС, Организация = &Организация) КАК ХозрасчетныйОстатки_ВосстановительнаяСтоимость
	|			ПО СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета = ХозрасчетныйОстатки_ВосстановительнаяСтоимость.Счет
	|				И СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = ХозрасчетныйОстатки_ВосстановительнаяСтоимость.Субконто1
	|		ПО ВТСписокОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСписокОС";
	Запрос.УстановитьПараметр("ДатаОстатков", 		Новый Граница(КонецДня(ЦелевойОбъект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", 		ЦелевойОбъект.Организация);
	Запрос.УстановитьПараметр("СубконтоОС", 		ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.УстановитьПараметр("Склад", 				ЦелевойОбъект.игс_Склад);
	Результат = Запрос.Выполнить().Выгрузить();
	ЦелевойОбъект.Ос.Очистить();
	для Каждого ОсновноеСредство из результат Цикл
		НоваяСтрока = ЦелевойОбъект.Ос.Добавить();
		НоваяСтрока.ОсновноеСредство = ОсновноеСредство.ОсновноеСредство;
		НоваяСтрока.СтоимостьПоДаннымУчета = ОсновноеСредство.СтоимостьПоДаннымУчета;
		НоваяСтрока.НаличиеПоДаннымУчета = Истина;
		НоваяСтрока.КоличествоПоДаннымУчета = 1;
		НоваяСтрока.НаличиеФактическое = Истина;
		НоваяСтрока.КоличествоФактическое = 1;
		НоваяСтрока.СтоимостьПоРезультатамИнвентаризации = ОсновноеСредство.СтоимостьПОДаннымУчета;
		НоваяСтрока.СтоимостьПоУчетуЗаЕдиницу = ОсновноеСредство.СтоимостьПОДаннымУчета;
	КонецЦикла;
	целевойобъект.Записать();	
    Возврат 
КонецПроцедуры