
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт   

	Версия = "1.0";
	КраткоеОписание = "Распределение затрат по флотам (ИГС)";
	Информация     = "Обработка позволяет распределять Расходы и Выручку по Флотам. 
	|Автор: <ИГС> ПР Потылицын Г.С. #0009, 07.07.2025";
	Идентификатор = "игсРаспределениеЗатратПоФлотам";

    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Информация = НСтр("ru = '" + Информация + "'");
    ПараметрыРегистрации.Версия = Версия;

    НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = КраткоеОписание;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    НоваяКоманда.ПоказыватьОповещение = Ложь;

    Возврат ПараметрыРегистрации;

КонецФункции  

#КонецОбласти