
&НаСервере
Функция ПечатьНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	возврат  ДокументОбъект.Печать(ОбъектыНазначения	 ,новый ТаблицаЗначений, новый СписокЗначений, новый Структура);
КонецФункции


&НаКлиенте
Процедура Печать(Команда)
	Результат = ПечатьнаСервере();
	Результат.Показать()
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДЛя каждого Назначение из Параметры.ОбъектыНазначения Цикл
		ОбъектыНазначения.Добавить(Назначение);
	КонецЦикла;
КонецПроцедуры

