
&НаСервере
Функция ЗапросОС()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	игсОстаткиОСНаСкладахОстатки.ОС КАК ОС
	               |ИЗ
	               |	РегистрНакопления.игсОстаткиОСНаСкладах.Остатки(
	               |			&ДатаГраница,
	               |			Склад = &Склад
	               |				И Организация = &Организация) КАК игсОстаткиОСНаСкладахОстатки";
	Если Объект.Организацияотбор.Пустая() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация","Истина");
	Иначе
		Запрос.УстановитьПараметр("Организация", объект.ОрганизацияОтбор);
	КонецЕсли;
	Если Объект.Складотбор.Пустая() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Склад = &Склад","Истина");
	Иначе
		Запрос.УстановитьПараметр("Склад", объект.СкладОтбор);
	КонецЕсли;
	Если Объект.Датаотбор = Дата('00010101') Тогда
		Запрос.УстановитьПараметр("ДатаГраница", новый Граница(ТекущаяДатаСеанса(), ВидГраницы.Включая));
	Иначе
		Запрос.УстановитьПараметр("ДатаГраница", Новый Граница(объект.ДатаОтбор, ВидГраницы.Включая));
	КонецЕсли;

	
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();	
КонецФункции


&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив) Экспорт
	Объект.СсылкаНаОбъект = ВладелецФормы.объект.Ссылка;
    ОбъектЗаполнения=Объект.СсылкаНаОбъект;
    ЗакрытиеФормы = Новый ОписаниеОповещения  
    ("ЗаполнениеПоВыбраннымПараметрам", ЭтаФорма); // Название процедуры, которая будет выполняться после закрытия формы "ЗапросПараметров"
	Если ТипЗнч(Объект.СсылкаНаОбъект) = Тип("ДокументСсылка.ПеремещениеОС") Тогда
		 Объект.СкладОтбор = ВладелецФормы.объект.игсСкладОтправитель;
		 Объект.ОрганизацияОтбор = ВладелецФормы.объект.Организация;
		 ЗаполнениеПоВыбраннымПараметрам(истина,истина)
	Иначе
    	ЗапросПараметров = ОткрытьФорму("ВнешняяОбработка.ЗаполнениеТЧОСПоОстаткамОсНаСкладах.Форма.ЗапросПараметров", ,ОбъектЗаполнения,,,,ЗакрытиеФормы,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнениеПоВыбраннымПараметрам(Результат, Параметры) Экспорт
    Если Не Результат Тогда
        Возврат; // Пользователь не стал указывать параметры, останавливаем работу
    КонецЕсли;
    ОбъектЗаполнения = ЗаполнениеНаСервере(ОбъектЗаполнения, Результат); // Результат содержит структуру, полученную из формы "ЗапросПараметров"
    Если НЕ ВладелецФормы = Неопределено Тогда
        ВладелецФормы.Прочитать(); // Если обработка вызывалась из документа, то нужно перечитать изменения, чтобы пользователь видел результат обработки
    КонецЕсли;
КонецПроцедуры  

&НаСервере
функция ЗаполнениеНаСервере(ОбъектЗаполнения, Параметры = Неопределено)
    Если ЗначениеЗаполнено(Объект.СсылкаНаОбъект) Тогда // Проверяем режим запуска: Через Открыть или из документа
        Док = Объект.СсылкаНаОбъект.ПолучитьОбъект();
    Иначе Док = ОбъектЗаполнения;
	КонецЕсли;
    ДанныеОС = ЗапросОС();
	Док.ОС.Очистить();
	Для каждого ос из ДанныеОС Цикл 
		СтрокаОс = Док.Ос.Добавить();
		СтрокаОС.ОсновноеСредство = ос.ос;
	КонецЦикла;	
   Док.Записать(); // Сохраняем результат
КонецФункции

