Функция СведенияОВнешнейОбработке() Экспорт 
	
	Команды = ПолучитьТаблицуКоманд();
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма");
	ПараметрыРегистрации.Вставить("Назначение",ПолучитьНазначенияОбработки());
	ПараметрыРегистрации.Вставить("Наименование", "Печать КС-2");
	ПараметрыРегистрации.Вставить("Версия", "1.0");
	ПараметрыРегистрации.Вставить("Информация", "Задача БСО КС-2 №00-1833 Колосов Р.Б Профрешение");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Команды", Команды);
	
	ДобавитьКоманду(Команды, "Печать КС-2", "Печать_КС2", "ВызовСерверногоМетода", Ложь, "ПечатьXML");
	
	Возврат ПараметрыРегистрации;
КонецФункции    

Функция ПолучитьНазначенияОбработки()
	
	Массив = Новый Массив;
	Массив.Добавить("Документ.ИмпРеализацияСтроительныхРаботУслуг");
	
	Возврат Массив;	
КонецФункции 

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
КонецФункции     

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;	
	НоваяКоманда.Использование = Использование;	
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры  

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
	
	  УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(ПараметрыВывода, "КС2", Нстр("ru = 'Печать КС-2'"),
	  		ПечатьКС2БСО(МассивОбъектов, ОбъектыПечати),,,);
	  
	
КонецПроцедуры  
  
Функция ПечатьКС2БСО(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет       = ПолучитьМакет("КС2");

	Стройка = "";
	Объект = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИмпРеализацияСтроительныхРаботУслуг.НоменклатурнаяГруппа.Родитель КАК Скважина,
	|	ИмпРеализацияСтроительныхРаботУслуг.НоменклатурнаяГруппа.Родитель.Родитель.Родитель КАК Месторождение,
	|	ИмпРеализацияСтроительныхРаботУслуг.Дата КАК Дата,
	|	ИмпРеализацияСтроительныхРаботУслуг.Инвестор КАК Инвестор,
	|	ИмпРеализацияСтроительныхРаботУслуг.Номер КАК Номер,
	|	ИмпРеализацияСтроительныхРаботУслуг.ДоговорКонтрагента.Номер КАК ДоговорКонтрагентаНомер,
	|	ИмпРеализацияСтроительныхРаботУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ИмпРеализацияСтроительныхРаботУслуг.Контрагент КАК Контрагент,
	|	ИмпРеализацияСтроительныхРаботУслуг.Организация КАК Организация,
	|	ИмпРеализацияСтроительныхРаботУслуг.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ИмпРеализацияСтроительныхРаботУслуг.ПодписьПодрядчик КАК ПодписьПодрядчик
	|ИЗ
	|	Документ.ИмпРеализацияСтроительныхРаботУслуг КАК ИмпРеализацияСтроительныхРаботУслуг
	|ГДЕ
	|	ИмпРеализацияСтроительныхРаботУслуг.Ссылка = &Ссылка";	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);

	Результаты = Запрос.Выполнить().Выбрать();

	ВыборкаДетальныеЗаписи = Результаты;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стройка = ВыборкаДетальныеЗаписи.Скважина; 
		Объект = ВыборкаДетальныеЗаписи.Месторождение;
	КонецЦикла;

	// // Шапка // *****
	СведенияОИнвесторе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаДетальныеЗаписи.Инвестор, ВыборкаДетальныеЗаписи.Дата);
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Инвестор = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОИнвесторе, "ПолноеНаименование,ЮридическийАдрес,Телефоны,Факс");;
	ОбластьМакета.Параметры.Стройка = Стройка;
	ОбластьМакета.Параметры.Объект = Объект;
	
    ОбластьМакета.Параметры.Договор = ВыборкаДетальныеЗаписи.ДоговорКонтрагентаНомер;
    ОбластьМакета.Параметры.ДатаДоговора = ВыборкаДетальныеЗаписи.Дата;
	ОбластьМакета.Параметры.ДатаС = Формат(НачалоМесяца(ВыборкаДетальныеЗаписи.Дата),"ДЛФ=Д");
	ОбластьМакета.Параметры.ДатаДо = Формат(КонецМесяца(ВыборкаДетальныеЗаписи.Дата),"ДЛФ=Д");
	
	ОбластьМакета.Параметры.НомерДок = ВыборкаДетальныеЗаписи.Номер;
    ОбластьМакета.Параметры.ДатаДок = Формат(ВыборкаДетальныеЗаписи.Дата,"ДЛФ=Д");

	ПредставлениеПодрядчика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаДетальныеЗаписи.Контрагент, ВыборкаДетальныеЗаписи.Дата),"ПолноеНаименование,ЮридическийАдрес,Телефоны,");;
	ОбластьМакета.Параметры.Подрядчик = ПредставлениеПодрядчика;
	ОбластьМакета.Параметры.ПоставщикУслуг = МассивОбъектов.Организация;
	
	ПредставлениеЗаказчика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаДетальныеЗаписи.Контрагент, ВыборкаДетальныеЗаписи.Дата),"ПолноеНаименование,ЮридическийАдрес,Телефоны,");;
	ОбластьМакета.Параметры.Заказчик = ПредставлениеЗаказчика;
	ОбластьМакета.Параметры.Получатель = МассивОбъектов.Контрагент;
	
	Сумма    = МассивОбъектов.Услуги.Итог("Сумма");
	СуммаНДС = МассивОбъектов.Услуги.Итог("СуммаНДС");
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаб");
	ТабДокумент.Вывести(ОбластьМакета);

	НомерСтроки = 0;
	
	Для Каждого ТекСтрокаУслуги Из МассивОбъектов.Услуги Цикл
		НомерСтроки = НомерСтроки + 1;
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");

		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
		ОбластьМакета.Параметры.ТоварНаименование = ТекСтрокаУслуги.Номенклатура;
		ОбластьМакета.Параметры.Количество = ТекСтрокаУслуги.Количество;
		ОбластьМакета.Параметры.БазоваяЕдИзм = СокрЛП(ВыборкаДетальныеЗаписи.НоменклатураЕдиницаИзмерения);
		ОбластьМакета.Параметры.Цена = ТекСтрокаУслуги.Цена;
		ОбластьМакета.Параметры.СуммаБезНДС = ТекСтрокаУслуги.Сумма;
		
		ТабДокумент.Вывести(ОбластьМакета);
	 
	 КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");

	ОбластьМакета.Параметры.ИтогСуммыСНДС = Сумма + СуммаНДС;
	ОбластьМакета.Параметры.Итого = Сумма;
	
	ДанныеФизЛицаСдал = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(МассивОбъектов.Организация, МассивОбъектов.ПодписьПодрядчик, МассивОбъектов.Дата);
	Должность = ДанныеФизЛицаСдал.Должность;
	ФИОполные = ДанныеФизЛицаСдал.Представление;
	Доверенность = "";
	
	ЗапросДоверенности = Новый Запрос();
	ЗапросДоверенности.УстановитьПараметр("ФизическоеЛицо", МассивОбъектов.ПодписьПодрядчик);
	ЗапросДоверенности.УстановитьПараметр("Организация", МассивОбъектов.Организация);
	ЗапросДоверенности.УстановитьПараметр("Дата", МассивОбъектов.Дата);
	ЗапросДоверенности.УстановитьПараметр("Должность", ДанныеФизЛицаСдал.Должность);
	ЗапросДоверенности.Текст =
	"ВЫБРАТЬ
	|	ОснованияПраваПодписи.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ОснованияПраваПодписи КАК ОснованияПраваПодписи
	|ГДЕ
	|	ОснованияПраваПодписи.ФизическоеЛицо = &ФизическоеЛицо
	|	И ОснованияПраваПодписи.Организация = &Организация
	|	И ОснованияПраваПодписи.ДатаНачала <= &Дата
	|	И ОснованияПраваПодписи.ДатаОкончания >= &Дата
	|	И ОснованияПраваПодписи.Должность = &Должность";
	ВыборкаДоверенности = ЗапросДоверенности.Выполнить().Выбрать();
	
	Пока  ВыборкаДоверенности.Следующий() Цикл
		
		Доверенность = ВыборкаДоверенности.Наименование;
	
	КонецЦикла;

	ОбластьМакета.Параметры.ДолжностьРуководителя = Должность;
	ОбластьМакета.Параметры.ФИОРуководителя = ФИОполные;
	ОбластьМакета.Параметры.Доверенность = Доверенность;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ОтображатьГруппировки = Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабДокумент;

КонецФункции
	