
&НаСервере
Функция ПечатьНаСервере()
	 ДокументОбъект = РеквизитФормыВЗначение("Объект");
	 МассивПечати = новый Массив;
	 МассивПечати.Добавить(ДокументОбъект.ссылканаОбъект);
	 возврат  ДокументОбъект.Печать(МассивПечати,новый ТаблицаЗначений, новый СписокЗначений, новый Структура);
КонецФункции


&НаКлиенте
Процедура Печать(Команда)
	Результат = ПечатьнаСервере();
	Результат.Показать()
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СсылкаНаОбъект = Параметры.ОбъектыНазначения[0];
КонецПроцедуры

