&НаСервере
Функция ПечатьНаСервере() 
	
	 ДокументОбъект = РеквизитФормыВЗначение("Объект");
	 МассивПечати = Новый Массив;
	 МассивПечати.Добавить(ДокументОбъект.СсылкаНаОбъект);
	 ДополнительнаяКолонка = ВыводитьНаФорму = 1;
	 
	 Результат = ДокументОбъект.Печать(МассивПечати, Новый ТаблицаЗначений, Новый СписокЗначений, Новый Структура, ВремяИнвентаризации = 0, ДополнительнаяКолонка);
	
	 Возврат Результат;
	 
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	Результат = ПечатьнаСервере();
	Результат.Показать()
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СсылкаНаОбъект = Параметры.ОбъектыНазначения[0];
КонецПроцедуры

